Revit 2027 API
AreaBasedLoadData.GetElectricalLoadAreas Method
 Gets electrical load areas which the area based load includes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetElectricalLoadAreas()
Public Function GetElectricalLoadAreas As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetElectricalLoadAreas()
member GetElectricalLoadAreas : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace